package messages;

public class CommandMessages {

    public static final  String COMMAND_MESSAGES="1. Сортиране на въведените числа във възходящ ред\n" +
            "2. Сортиране на въведените числа в низходящ ред\n" +
            "3. Търсене на позиция на конкретно число\n" +
            "4. Разбъркване на числата\n" +
            "5. Изчисляване на сбора на всички числа\n" +
            "6. Намиране на най-голямото число\n" +
            "7. Намиране на най-малкото число\n" +
            "8. Намиране средно-аритметично на числата\n" +
            "9. Проверка за симетричност на масива от числа\n" +
            "10. Обръщане на масива от числа\n" +
            "11. Визуализирай въведените числа\n" +
            "12. Изход";
}
